/*Задание на создание правильных переменных*/

<ol>
    <li><p>Создайте переменную, которая будет отображать имя пользователя. (Пользователь - user, имя - name). В неё поместите значение "John"</p></li>
    <li><p>На следующей строке создайте переменную, отображающую номер пользователя (номер - number). В неё поместите значение 25.</p></li>
    <li><p>Измените значение второй переменной с 25 на 24 на следующей строке.</p></li>
</ol>

'use strict';

let userName = 'John';
let userNumber = 25;
userNumber = 24;
