
// Совместимость актуальной версии React 18 и этого компонента
//Актуальная на этот момент версия библиотеки принесла несколько изменений, ломающих некоторый функционал. 
//Так называемых Breaking Changes. 
//Одно из них мы рассмотрели в уроке про JSX, где немного поменялся способ рендера приложения на страницу. 
//А второе, которое волнует нас сейчас, касается компонента Strict Mode:
// https://img-c.udemycdn.com/redactor/raw/article_lecture/2022-04-23_16-14-42-985ebcd1d971689d751b1b87d1633d2a.png

// Обратите внимание на этот пункт
// https://github.com/facebook/react/blob/main/CHANGELOG.md#react-1
// Можете даже не переводить все, мы еще пройдем все эти термины. 
// Достаточно выделенного мною текста. Потенциально это очень крутая возможность. 
// Но она может поломать части вашего приложения. Причем только в режиме разработки. 
// В готовой версии приложения все будет в порядке, так как и сам этот компонент там не работает.

// Так что на данный момент я не рекомендую использовать этот компонент в своих приложениях.
// Хотя бы до 9го модуля. В ответах он будет пока оставлен, так как там используется 17я версия. 
// Это + новый синтаксис рендера самого приложения - это единственная разница.

// К тому же, мы обнаружили, что часть сторонних библиотек тоже сейчас конфликтует с этим компонентом, 
// например React Router (будет изучен позже).

//Что можно сделать?
// Этот пункт стоит читать потом, когда вы закончите 8й модуль. И если вам интересно, конечно же :)
// Версия новая, мои боевые проекты еще не перешли на неё. 
// Но насколько я понимаю, теперь нужно каждый компонент "сбрасывать" при его размонтировании. 
// То есть, возвращать state в то состояние, которое должно быть изначально. Если только нет нужды в сохранении.

// Для этого можно воспользоваться componentWillUnmount или возвратом функции из useEffect. 
// Но все это сугубо индивидуально для разных компонентов, ведь есть еще те, что конфликтуют с другими библиотеками. 
// Возможно, с новыми апдейтами, все исправится. Но нужно быть начеку)