//!запомнить
//6) console.log(typeof(NaN)); // число (number)

//8) Что может находиться внутри массива как его элементы?
// любые сущности и типы данных

//9) Сколько аргументов может быть у функции?
// Не ограниченное количество

//10) Что делает метод split, примененный на строке?
// Метод split() разбивает объект String на массив строк путём разделения строки указанной подстрокой

//10) Что делает метод slice, примененный на строке?
//Метод slice() извлекает часть строки и возвращает новую строку без изменения оригинальной строки