

//1)  Делегирование событий - это прием, который позволяет...
//уменьшить количество обработчиков событий.
// проще взаимодействовать с DOM-деревом, легко работать с неограниченным количеством элементов в родителе.

//2) Свойство объекта события event.code позволяет получить...
//Код физической клавиши, которая была нажата. Вне зависимости от зажатых клавиш Shift или Alt

//3) Для чего необходимо сохранять уникальный идентификатор таймера?
//Для того, чтобы иметь возможность остановить этот конкретный таймер
