
// Семантическая верстка - соблюдение правил разметки контента в зависимости от смысловой нагрузки
// Одно из ядер семантики - семантические теги html

// Доступность - чтобы мог пользоваться кто угодно/ люди с ограниченными возможностями / с не работающей мышкой

// Не работающая мышка
// Навигация по клавиатуре
// Tab - вперед
// Shift + Tab - назад
// Свойсво outline - не убирать так как явдяется ориентиром (фокус) для таких ситуаций
// Аттрибут tabindex- позволяет контролировать работу с выделением
