
// Create React App (CRA) - пакет/готовая сборка, которая в одну команду создает полностью настроенное приложение 
    // все настройки уже готовы

// установка
// npx create-react-app my-app
// cd my-app
// npm start

// Структура проекта

// папка src
    // - index.js - собирает все приложение
    // - App.js - содержит базовую разметку
    // - reportWebVitals.js - файл для тестирования и для дополнительных функций

// папка public (содержит статичные файлы которые не будт меняться)
  //  index.html - основопологающий файл
    // в тег <div id="root"></div> - будет помещаться все приложение

//   Основными частями сборки является webpack и babel
//!!  Babel занисается переводом JSX в нативный JS

