// CRUD - создание чтение изменение удаление
// npm i
// npm start

// DU подобные (список дел)

//1) Логически разбить макет на блоки
//2) Готовую верстку раскатать на компоненты

// создание компонентов в отдельной папке components (структура )
// в папке ложить файлы .js и .css



// app-info - блок с общей информациец
// app-filter - блок фильтра
// search-panel - блок поиска
// employers-list -  блок со списком сотрудников
// employers-list-item -  блок одного сотрудника (элемент списка)
    // внутри блок с кнопками удаления/ отмечать на повышение/ управление
// employers-add-form -  блок добавления сотрудников
// app - общий компонент вывода всего приложения



