// HTTP - Hyper Text Transfer Protocol 
// HTTPS - Hyper Text Transfer Protocol Secure
// FTP - File Transfer Protocol
// sFTP - Защищенный аналог ftp

// SSH - Secure SHell Сетевой протокол
// Используется для удаленного управления операционнымии системами и передачей файлов

//SSH GitHub
// Открытые ключи - хранятся на сайте GitHub
// Закрытый ключ хранится у нас на ПК

//+ https
//1) проще авторизация через логин и пароль с разных ПК
//2) порт всегда открыт так как он базовый

//- https
//1) Логин и пароль
//2) при краже доступов, могут изменить данные в репозиториях и в аккаунте

//+ ssh
//1) если пара ключей совпадает - любое действие выполняется автоматически
//2) ключи более безопастны
//3) просто подключить любые устройства и операционные системы
//4) при краже ключа, могут изменить данные в репозиториях, но не в аккаунте

//- ssh
//1) первоначальная настройка
//2) порт может быть заблокирован брэндмауером


