
// Удаление сотрудника

// при клике на корзину - эта часть данных удалиться из data 
// Реакт увидит это изменение и перерисует приложение

// Осноная мысль 
// из корнего компонента мы можем прокинуть props c функцией
// из корнего файлв app.js -> employees-list.js -> employees-list-item.js

// Иммутабельность - неизменяемость state
// Называется объект когда  он не может быть изменен после его создания
// Чтобы внести изменения нужно создать копию этого объекта с уже введенными нововведениями

// Плюсы
// Сравнивая внутренности старого и нового объекта можно легко увидеть отличия

// Минусы
// Затрачиваются дополнительные ресурсы для хранения копий объектов

