// Консоль разработчика

'use strict';

//1) Вкладка Sources (Источники)
// Вкладка со всеми исходными материалами,которые нам доступны в открытом проекте
// можно дебажить код
// Позволяет устанавливать метки Breakpoint, чтобы останавливать код в определенном участке
// Выбираем строку и кликаем на нее, перезагружаем страницу, сообщение (Paused in debugger)

// После выставления меток Breakpoint 

// -- Меню Call Stack
// Последовательность операция котороая приводит к данной строчке

//--  Меню Scope
// Переменные с которыми идет работа в строке из меню Call Stack
// Разделяются на Local и Global

// -- Меню Breakpoint
// Где установлены  метки, номер строчки кода и что есть в этой строке

debugger; // ставить метки прямо в коде



//2) Вкладка Network (Сеть)
// Отвечает за работу с сетью. Можно отслеживать как быстро загружается скрипты, изображения, html
// А также запросы уходящие на сервер сайта

//3) Вкладка Performance
// Можно записать как работает/загружается какая либо структура



